package String;
/*
 * Класс String в Java представляет собой неизменяемую (immutable) последовательность символов.
 * Он является одним из наиболее распространенных классов в Java, который используется для работы со строками.
 *
 * Основные методы класса String():
 * length() - возвращает длину строки.
 * substring(int beginIndex, int endIndex) - возвращает подстроку данной строки, начиная с индекса beginIndex и заканчивая индексом endIndex - 1.
 * equals(Object anObject) - сравнивает эту строку с указанным объектом.
 * compareTo(String anotherString) - сравнивает строку с другой строкой в лексикографическом порядке.
 * indexOf(int ch) - возвращает индекс первого вхождения указанного символа в строку.
 * lastIndexOf(int ch) - возвращает индекс последнего вхождения указанного символа в строку.
 * contains(CharSequence s) - возвращает true, если строка содержит указанную последовательность символов, и false в противном случае.
 * toUpperCase() - возвращает строку, где все буквы преобразованы в верхний регистр.
 * toLowerCase() - возвращает строку, где все буквы преобразованы в нижний регистр.
 * trim() - удаляет начальные и конечные пробелы строки.
 * replace(CharSequence target, CharSequence replacement) - заменяет все вхождения указанной последовательности символов на другую последовательность символов.
 * split(String regex) - разделяет строку на массив подстрок, используя указанный регулярный выражение в качестве разделителя.
 * join(CharSequence delimiter, CharSequence... elements) - объединяет указанные элементы в строку, используя указанный разделитель.
 * format(String format, Object... args) - форматирует строку с использованием указанного формата и аргументов.
*/
public class Animal {
}
