package Streams;
/*
    Stream это последовательность элементов, поддерживающих последовательные и параллельные операции над ними.

    Методы Stream не меняют саму коллекцию или массив, от которого был создан stream.

    Stream в не хранит данные, а предоставляет набор методов для обработки данных в виде последовательности элементов.
    Он может использоваться для выполнения различных операций, таких как фильтрация, сортировка, маппинг, сведение и т.д.
    Stream может быть создан из разных источников, например, из массива, списка, файла, потока данных и т.д.
*/
public class Main {
}
